# =========================================================
# اليوم 6: التحكم والمنطق - الشروط المتداخلة Nested If
# =========================================================

# تطبيق 1: تصنيف الطلبات
order_type = "express"
price = 120

if order_type == "express":
    if price >= 100:
        print("الطلب: مستعجل - القيمة: مرتفعة")
    else:
        print("الطلب: مستعجل - القيمة: عادية")
else:
    print("الطلب: عادي")

# تطبيق 2: فحص البريد الإلكتروني
user_email = "test@domain.com"

if "@" in user_email and "." in user_email:
    print("تم التحقق: البريد الإلكتروني صيغته سليمة!")
==================<====≈===========≈==≈=======
